# General errors
uncategorized.exception=\u0110\u00E3 x\u1EA3y ra l\u1ED7i h\u1EC7 th\u1ED1ng, vui l\u00F2ng th\u1EED l\u1EA1i sau!
key.invalid=D\u1EEF li\u1EC7u truy\u1EC1n v\u00E0o kh\u00F4ng h\u1EE3p l\u1EC7!

# Email errors
email.exists=Email n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i trong h\u1EC7 th\u1ED1ng!
email.not.existed=Email n\u00E0y kh\u00F4ng t\u1ED3n t\u1EA1i!
email.not.blank=Email kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
email.valid=Email kh\u00F4ng \u0111\u00FAng \u0111\u1ECBnh d\u1EA1ng!

# User errors
username.not.blank=T\u00EAn \u0111\u0103ng nh\u1EADp kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
password.invalid=M\u1EADt kh\u1EA9u ph\u1EA3i c\u00F3 \u00EDt nh\u1EA5t 6 k\u00FD t\u1EF1!
password.not.blank=M\u1EADt kh\u1EA9u kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
password.old.not.blank=M\u1EADt kh\u1EA9u c\u0169 kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
password.new.not.blank=M\u1EADt kh\u1EA9u m\u1EDBi kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
password.old.invalid=M\u1EADt kh\u1EA9u c\u0169 kh\u00F4ng ch\u00EDnh x\u00E1c!
password.new.same.old=M\u1EADt kh\u1EA9u m\u1EDBi kh\u00F4ng \u0111\u01B0\u1EE3c tr\u00F9ng v\u1EDBi m\u1EADt kh\u1EA9u c\u0169!
username.exists=T\u00EAn \u0111\u0103ng nh\u1EADp n\u00E0y \u0111\u00E3 \u0111\u01B0\u1EE3c ng\u01B0\u1EDDi kh\u00E1c s\u1EED d\u1EE5ng!

# Authentication errors
unauthenticated=X\u00E1c th\u1EF1c ng\u01B0\u1EDDi d\u00F9ng th\u1EA5t b\u1EA1i!
unauthorized=B\u1EA1n kh\u00F4ng c\u00F3 quy\u1EC1n truy c\u1EADp ch\u1EE9c n\u0103ng n\u00E0y!

# Role errors
role.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y quy\u1EC1n (role) n\u00E0y!

# Delete user errors
user.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y ng\u01B0\u1EDDi d\u00F9ng!
user.cannot.delete.self=Kh\u00F4ng th\u1EC3 t\u1EF1 xo\u00E1 t\u00E0i kho\u1EA3n c\u1EE7a ch\u00EDnh m\u00ECnh!

# Success messages
success=Thao t\u00E1c th\u00E0nh c\u00F4ng!
created.success=Th\u00EAm m\u1EDBi th\u00E0nh c\u00F4ng!
updated.success=C\u1EADp nh\u1EADt th\u00E0nh c\u00F4ng!
deleted.success=X\u00F3a v\u0129nh vi\u1EC5n th\u00E0nh c\u00F4ng!
deleted.soft.success=\u0110\u00E3 chuy\u1EC3n v\u00E0o th\u00F9ng r\u00E1c!
restored.success=Kh\u00F4i ph\u1EE5c th\u00E0nh c\u00F4ng!
password.changed.success=\u0110\u1ED5i m\u1EADt kh\u1EA9u th\u00E0nh c\u00F4ng!

# Category errors
category.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y danh m\u1EE5c n\u00E0y!
category.name.not.blank=T\u00EAn danh m\u1EE5c kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
category.name.exists=T\u00EAn danh m\u1EE5c n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i!
category.slug.not.blank=\u0110\u01B0\u1EDDng d\u1EABn (Slug) kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
category.slug.exists=\u0110\u01B0\u1EDDng d\u1EABn (Slug) n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i!
category.parent.not.found=Danh m\u1EE5c cha kh\u00F4ng t\u1ED3n t\u1EA1i!
category.parent.invalid=Kh\u00F4ng th\u1EC3 ch\u1ECDn danh m\u1EE5c con ho\u1EB7c ch\u00E1u l\u00E0m danh m\u1EE5c cha!
category.has.child=Danh m\u1EE5c n\u00E0y \u0111ang ch\u1EE9a c\u00E1c danh m\u1EE5c con, kh\u00F4ng th\u1EC3 xo\u00E1!

# Brand errors
brand.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y th\u01B0\u01A1ng hi\u1EC7u n\u00E0y!
brand.name.not.blank=T\u00EAn th\u01B0\u01A1ng hi\u1EC7u kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
brand.name.exists=T\u00EAn th\u01B0\u01A1ng hi\u1EC7u \u0111\u00E3 t\u1ED3n t\u1EA1i!
brand.slug.not.blank=\u0110\u01B0\u1EDDng d\u1EABn (Slug) th\u01B0\u01A1ng hi\u1EC7u kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
brand.slug.exists=\u0110\u01B0\u1EDDng d\u1EABn (Slug) th\u01B0\u01A1ng hi\u1EC7u n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i!

# Upload file errors
file.type.invalid=\u0110\u1ECBnh d\u1EA1ng file kh\u00F4ng h\u1EE3p l\u1EC7!
file.too.large=K\u00EDch th\u01B0\u1EDBc \u1EA3nh v\u01B0\u1EE3t qu\u00E1 gi\u1EDBi h\u1EA1n cho ph\u00E9p!
upload.image.failed=T\u1EA3i \u1EA3nh l\u00EAn th\u1EA5t b\u1EA1i!

# Author errors
author.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y th\u00F4ng tin t\u00E1c gi\u1EA3!
author.name.not.blank=T\u00EAn t\u00E1c gi\u1EA3 kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
author.name.exists=T\u00EAn t\u00E1c gi\u1EA3 n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i!
author.email.not.blank=Email t\u00E1c gi\u1EA3 kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng!
author.email.valid=Email t\u00E1c gi\u1EA3 kh\u00F4ng \u0111\u00FAng \u0111\u1ECBnh d\u1EA1ng!
author.email.exists=Email t\u00E1c gi\u1EA3 n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i!
author.cannot.delete=Kh\u00F4ng th\u1EC3 xo\u00E1 t\u00E1c gi\u1EA3 n\u00E0y v\u00EC \u0111ang c\u00F3 d\u1EEF li\u1EC7u s\u00E1ch li\u00EAn k\u1EBFt!